import pandas as pd
import pytest


@pytest.fixture()
def df_test():
    return pd.DataFrame(
        {
            "Дата операции": [
                "21.12.2021 01:06:22",
                "20.12.2021 12:06:22",
                "01.12.2021 01:06:22",
                "31.12.2021 00:12:53",
                "08.09.2024 00:12:53",
            ],
            "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*7197"],
            "Сумма платежа": [-160.89, 5000, 23.60, -645.78, 1588.36],
            "Категория": ["Переводы", "Развлечения", "Переводы", "Такси", "Госуслуги"],
            "Описание": [
                "Перевод Кредитная карта. ТП 10.2 RUR",
                "sevs.eduerp.ru",
                "Дмитрий Р.",
                "Яндекс Такси",
                "Почта России",
            ],
            "Дата платежа": ["21.12.2021", "20.12.2021", "01.12.2021", "31.12.2021", "08.09.2024"],
        }
    )
